Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияПравилПаевогоИнвестиционногоФонда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МинимальнаяСуммаЗачисления</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредназначенДляКвалИнвесторов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьВСЧАРезервыЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеДепозитарияВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаВознаграждениеУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьРезервыЗаПрочиеВозмещаемыеРасходыУправляющегоВБэкОфисе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплатыПриЧастичномПогашении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВестиУчетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаВознаграждениеДепозитария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрокаОплатыВознагражденияУК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаНадбавкиПриПриобретенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаРасчетаСкидкиПриПогашенииПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияПравилПаевогоИнвестиционногоФонда/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// В настройках расчета резервов ПИФ не допускаем более одной составляющей
	ТаблицаНабора = ЭтотОбъект.Выгрузить();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаНабора.Период КАК Период,
		|	ТаблицаНабора.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
		|	ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеУправляющего КАК НастройкаРасчетаРезервовЗаВознаграждениеУправляющего,
		|	ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеДепозитария КАК НастройкаРасчетаРезервовЗаВознаграждениеДепозитария,
		|	ТаблицаНабора.НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего КАК НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего
		|ПОМЕСТИТЬ _ТаблицаНабора
		|ИЗ
		|	&ТаблицаНабора КАК ТаблицаНабора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ТаблицаНабора.Период КАК Период,
		|	_ТаблицаНабора.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеУправляющего КАК НастройкаРасчета
		|ПОМЕСТИТЬ _НастройкиРасчета
		|ИЗ
		|	_ТаблицаНабора КАК _ТаблицаНабора
		|ГДЕ
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеУправляющего <> ЗНАЧЕНИЕ(Справочник.НастройкиРасчета.)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ТаблицаНабора.Период,
		|	_ТаблицаНабора.ПаевойИнвестиционныйФонд,
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеДепозитария
		|ИЗ
		|	_ТаблицаНабора КАК _ТаблицаНабора
		|ГДЕ
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаВознаграждениеДепозитария <> ЗНАЧЕНИЕ(Справочник.НастройкиРасчета.)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ТаблицаНабора.Период,
		|	_ТаблицаНабора.ПаевойИнвестиционныйФонд,
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего
		|ИЗ
		|	_ТаблицаНабора КАК _ТаблицаНабора
		|ГДЕ
		|	_ТаблицаНабора.НастройкаРасчетаРезервовЗаПрочиеВозмещаемыеРасходыУправляющего <> ЗНАЧЕНИЕ(Справочник.НастройкиРасчета.)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиРасчета.Период КАК Период,
		|	_НастройкиРасчета.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд,
		|	_НастройкиРасчета.НастройкаРасчета КАК НастройкаРасчета
		|ИЗ
		|	_НастройкиРасчета КАК _НастройкиРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК НастройкиРасчетаСоставляющие
		|		ПО _НастройкиРасчета.НастройкаРасчета = НастройкиРасчетаСоставляющие.Ссылка
		|			И (НастройкиРасчетаСоставляющие.НомерСтроки = 2)");
	
	Запрос.УстановитьПараметр("ТаблицаНабора", ТаблицаНабора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		
		ТекстСообщения = "Для расчета резервов не реализовано объединение баз расчета. Необходимо исправить настройки:" + Символы.ПС;
		
		Пока Выборка.Следующий() Цикл
		
			ТекстСообщения = ТекстСообщения + СтрШаблон("%1 - '%2', ПИФ '%3', дата %4%5",
													Символы.Таб,  
													Выборка.НастройкаРасчета,
													Выборка.ПаевойИнвестиционныйФонд,
													Формат(Выборка.Период, "ДФ=dd.MM.yyyy"),
													Символы.ПС);		
		 		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ПрименяютсяНадбавкиИСкидкиПриЗачисленииИПогашенииПаев Тогда
			
			ПроверяемыеРеквизиты.Добавить("НастройкаРасчетаНадбавкиПриПриобретенииПаев");
			ПроверяемыеРеквизиты.Добавить("НастройкаРасчетаСкидкиПриПогашенииПаев");
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
